sangjun19/Deobfuscator/data/github_api/github_switch_codes_c/ICOMP-UNC_Los-Intocables_lpc17xx_uart.c
/**********************************************************************
 * $Id$		lpc17xx_uart.c			2011-06-06
 *//**
* @file		lpc17xx_uart.c
* @brief	Contains all functions support for UART firmware library
* 			on LPC17xx
* @version	3.2
* @date		25. July. 2011
* @author	NXP MCU SW Application Team
*
* Copyright(C) 2011, NXP Semiconductor
* All rights reserved.
*
***********************************************************************
* Software that is described herein is for illustrative purposes only
* which provides customers with programming information regarding the
* products. This software is supplied "AS IS" without any warranties.
* NXP Semiconductors assumes no responsibility or liability for the
* use of the software, conveys no license or title under any patent,
* copyright, or mask work right to the product. NXP Semiconductors
* reserves the right to make changes in the software without
* notification. NXP Semiconductors also make no representation or
* warranty that such application will be suitable for the specified
* use without further testing or modification.
* Permission to use, copy, modify, and distribute this software and its
* documentation is hereby granted, under NXP Semiconductors'
* relevant copyright in the software, without fee, provided that it
* is used in conjunction with NXP Semiconductors microcontrollers.  This
* copyright, permission, and disclaimer notice must appear in all copies of
* this code.
**********************************************************************/

/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup UART
 * @{
 */

/* Includes ------------------------------------------------------------------- */
#include "lpc17xx_uart.h"
#include "lpc17xx_clkpwr.h"

/* If this source file built with example, the LPC17xx FW library configuration
 * file in each example directory ("lpc17xx_libcfg.h") must be included,
 * otherwise the default FW library configuration file must be included instead
 */
#ifdef __BUILD_WITH_EXAMPLE__
#include "lpc17xx_libcfg.h"
#else
#include "lpc17xx_libcfg_default.h"
#endif /* __BUILD_WITH_EXAMPLE__ */

#ifdef _UART

/* Private Functions ---------------------------------------------------------- */

static Status uart_set_divisors(LPC_UART_TypeDef* UARTx, uint32_t baudrate);

/*********************************************************************/ /**
                                                                         * @brief		Determines best dividers to get
                                                                         *a target clock rate
                                                                         * @param[in]	UARTx	Pointer to selected UART
                                                                         *peripheral, should be:
                                                                         * 				- LPC_UART0: UART0 peripheral
                                                                         * 				- LPC_UART1: UART1 peripheral
                                                                         * 				- LPC_UART2: UART2 peripheral
                                                                         * 				- LPC_UART3: UART3 peripheral
                                                                         * @param[in]	baudrate Desired UART baud rate.
                                                                         * @return 		Error status, could be:
                                                                         * 				- SUCCESS
                                                                         * 				- ERROR
                                                                         **********************************************************************/
static Status uart_set_divisors(LPC_UART_TypeDef* UARTx, uint32_t baudrate)
{
    Status errorStatus = ERROR;

    uint32_t uClk = 0;
    uint32_t d, m, bestd, bestm, tmp;
    uint64_t best_divisor, divisor;
    uint32_t current_error, best_error;
    uint32_t recalcbaud;

    /* get UART block clock */
    if (UARTx == (LPC_UART_TypeDef*)LPC_UART0)
    {
        uClk = CLKPWR_GetPCLK(CLKPWR_PCLKSEL_UART0);
    }
    else if (UARTx == (LPC_UART_TypeDef*)LPC_UART1)
    {
        uClk = CLKPWR_GetPCLK(CLKPWR_PCLKSEL_UART1);
    }
    else if (UARTx == LPC_UART2)
    {
        uClk = CLKPWR_GetPCLK(CLKPWR_PCLKSEL_UART2);
    }
    else if (UARTx == LPC_UART3)
    {
        uClk = CLKPWR_GetPCLK(CLKPWR_PCLKSEL_UART3);
    }

    /* In the Uart IP block, baud rate is calculated using FDR and DLL-DLM registers
     * The formula is :
     * BaudRate= uClk * (mulFracDiv/(mulFracDiv+dividerAddFracDiv) / (16 * (DLL)
     * It involves floating point calculations. That's the reason the formulae are adjusted with
     * Multiply and divide method.*/
    /* The value of mulFracDiv and dividerAddFracDiv should comply to the following expressions:
     * 0 < mulFracDiv <= 15, 0 <= dividerAddFracDiv <= 15 */
    best_error = 0xFFFFFFFF; /* Worst case */
    bestd = 0;
    bestm = 0;
    best_divisor = 0;
    for (m = 1; m <= 15; m++)
    {
        for (d = 0; d < m; d++)
        {
            divisor = ((uint64_t)uClk << 28) * m / (baudrate * (m + d));
            current_error = divisor & 0xFFFFFFFF;

            tmp = divisor >> 32;

            /* Adjust error */
            if (current_error > ((uint32_t)1 << 31))
            {
                current_error = -current_error;
                tmp++;
            }

            if (tmp < 1 || tmp > 65536) /* Out of range */
                continue;

            if (current_error < best_error)
            {
                best_error = current_error;
                best_divisor = tmp;
                bestd = d;
                bestm = m;
                if (best_error == 0)
                    break;
            }
        } /* end of inner for loop */

        if (best_error == 0)
            break;
    } /* end of outer for loop  */

    if (best_divisor == 0)
        return ERROR; /* can not find best match */

