sangjun19/Deobfuscator/data/github_api/github_switch_codes_c/ICOMP-UNC_Los-Intocables_lpc17xx_uart.c
    recalcbaud = (uClk >> 4) * bestm / (best_divisor * (bestm + bestd));

    /* reuse best_error to evaluate baud error*/
    if (baudrate > recalcbaud)
        best_error = baudrate - recalcbaud;
    else
        best_error = recalcbaud - baudrate;

    best_error = best_error * 100 / baudrate;

    if (best_error < UART_ACCEPTED_BAUDRATE_ERROR)
    {
        if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
        {
            ((LPC_UART1_TypeDef*)UARTx)->LCR |= UART_LCR_DLAB_EN;
            ((LPC_UART1_TypeDef*)UARTx)->/*DLIER.*/ DLM = UART_LOAD_DLM(best_divisor);
            ((LPC_UART1_TypeDef*)UARTx)->/*RBTHDLR.*/ DLL = UART_LOAD_DLL(best_divisor);
            /* Then reset DLAB bit */
            ((LPC_UART1_TypeDef*)UARTx)->LCR &= (~UART_LCR_DLAB_EN) & UART_LCR_BITMASK;
            ((LPC_UART1_TypeDef*)UARTx)->FDR = (UART_FDR_MULVAL(bestm) | UART_FDR_DIVADDVAL(bestd)) & UART_FDR_BITMASK;
        }
        else
        {
            UARTx->LCR |= UART_LCR_DLAB_EN;
            UARTx->/*DLIER.*/ DLM = UART_LOAD_DLM(best_divisor);
            UARTx->/*RBTHDLR.*/ DLL = UART_LOAD_DLL(best_divisor);
            /* Then reset DLAB bit */
            UARTx->LCR &= (~UART_LCR_DLAB_EN) & UART_LCR_BITMASK;
            UARTx->FDR = (UART_FDR_MULVAL(bestm) | UART_FDR_DIVADDVAL(bestd)) & UART_FDR_BITMASK;
        }
        errorStatus = SUCCESS;
    }

    return errorStatus;
}

/* End of Private Functions ---------------------------------------------------- */

/* Public Functions ----------------------------------------------------------- */
/** @addtogroup UART_Public_Functions
 * @{
 */
/* UART Init/DeInit functions -------------------------------------------------*/
/********************************************************************/ /**
                                                                        * @brief		Initializes the UARTx peripheral
                                                                        *according to the specified parameters in the
                                                                        *UART_ConfigStruct.
                                                                        * @param[in]	UARTx	UART peripheral
                                                                        *selected, should be:
                                                                        *   			- LPC_UART0: UART0 peripheral
                                                                        * 				- LPC_UART1: UART1 peripheral
                                                                        * 				- LPC_UART2: UART2 peripheral
                                                                        * 				- LPC_UART3: UART3 peripheral
                                                                        * @param[in]	UART_ConfigStruct Pointer to a
                                                                        *UART_CFG_Type structure that contains the
                                                                        *configuration information for the specified
                                                                        *UART peripheral.
                                                                        * @return 		None
                                                                        *********************************************************************/
void UART_Init(LPC_UART_TypeDef* UARTx, UART_CFG_Type* UART_ConfigStruct)
{
    uint32_t tmp;

    // For debug mode
    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_UART_DATABIT(UART_ConfigStruct->Databits));
    CHECK_PARAM(PARAM_UART_STOPBIT(UART_ConfigStruct->Stopbits));
    CHECK_PARAM(PARAM_UART_PARITY(UART_ConfigStruct->Parity));

#ifdef _UART0
    if (UARTx == (LPC_UART_TypeDef*)LPC_UART0)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCUART0, ENABLE);
    }
#endif

#ifdef _UART1
    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCUART1, ENABLE);
    }
#endif

#ifdef _UART2
    if (UARTx == LPC_UART2)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCUART2, ENABLE);
    }
#endif

#ifdef _UART3
    if (UARTx == LPC_UART3)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR(CLKPWR_PCONP_PCUART3, ENABLE);
    }
#endif

    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        /* FIFOs are empty */
        ((LPC_UART1_TypeDef*)UARTx)->/*IIFCR.*/ FCR = (UART_FCR_FIFO_EN | UART_FCR_RX_RS | UART_FCR_TX_RS);
        // Disable FIFO
        ((LPC_UART1_TypeDef*)UARTx)->/*IIFCR.*/ FCR = 0;

        // Dummy reading
        while (((LPC_UART1_TypeDef*)UARTx)->LSR & UART_LSR_RDR)
        {
            tmp = ((LPC_UART1_TypeDef*)UARTx)->/*RBTHDLR.*/ RBR;
        }

        ((LPC_UART1_TypeDef*)UARTx)->TER = UART_TER_TXEN;
        // Wait for current transmit complete
        while (!(((LPC_UART1_TypeDef*)UARTx)->LSR & UART_LSR_THRE))
        {
        }
        // Disable Tx
        ((LPC_UART1_TypeDef*)UARTx)->TER = 0;

        // Disable interrupt
        ((LPC_UART1_TypeDef*)UARTx)->/*DLIER.*/ IER = 0;
        // Set LCR to default state
        ((LPC_UART1_TypeDef*)UARTx)->LCR = 0;
        // Set ACR to default state
        ((LPC_UART1_TypeDef*)UARTx)->ACR = 0;
        // Set Modem Control to default state
        ((LPC_UART1_TypeDef*)UARTx)->MCR = 0;
        // Set RS485 control to default state
        ((LPC_UART1_TypeDef*)UARTx)->RS485CTRL = 0;
        // Set RS485 delay timer to default state
        ((LPC_UART1_TypeDef*)UARTx)->RS485DLY = 0;
        // Set RS485 addr match to default state
        ((LPC_UART1_TypeDef*)UARTx)->ADRMATCH = 0;
        // Dummy Reading to Clear Status
        tmp = ((LPC_UART1_TypeDef*)UARTx)->MSR;
        tmp = ((LPC_UART1_TypeDef*)UARTx)->LSR;
    }
    else
    {
        /* FIFOs are empty */
        UARTx->/*IIFCR.*/ FCR = (UART_FCR_FIFO_EN | UART_FCR_RX_RS | UART_FCR_TX_RS);
        // Disable FIFO
        UARTx->/*IIFCR.*/ FCR = 0;

