sangjun19/Deobfuscator/data/github_api/github_switch_codes_c/ICOMP-UNC_Los-Intocables_lpc17xx_uart.c
    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        ((LPC_UART1_TypeDef*)UARTx)->/*RBTHDLR.*/ THR = Data & UART_THR_MASKBIT;
    }
    else
    {
        UARTx->/*RBTHDLR.*/ THR = Data & UART_THR_MASKBIT;
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Receive a single data from UART
                                                                         *peripheral
                                                                         * @param[in]	UARTx	UART peripheral
                                                                         *selected, should be:
                                                                         *  			- LPC_UART0: UART0 peripheral
                                                                         * 				- LPC_UART1: UART1 peripheral
                                                                         * 				- LPC_UART2: UART2 peripheral
                                                                         * 				- LPC_UART3: UART3 peripheral
                                                                         * @return 		Data received
                                                                         **********************************************************************/
uint8_t UART_ReceiveByte(LPC_UART_TypeDef* UARTx)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));

    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        return (((LPC_UART1_TypeDef*)UARTx)->/*RBTHDLR.*/ RBR & UART_RBR_MASKBIT);
    }
    else
    {
        return (UARTx->/*RBTHDLR.*/ RBR & UART_RBR_MASKBIT);
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Send a block of data via UART
                                                                         *peripheral
                                                                         * @param[in]	UARTx	Selected UART peripheral
                                                                         *used to send data, should be:
                                                                         *   			- LPC_UART0: UART0 peripheral
                                                                         * 				- LPC_UART1: UART1 peripheral
                                                                         * 				- LPC_UART2: UART2 peripheral
                                                                         * 				- LPC_UART3: UART3 peripheral
                                                                         * @param[in]	txbuf 	Pointer to Transmit
                                                                         *buffer
                                                                         * @param[in]	buflen 	Length of Transmit
                                                                         *buffer
                                                                         * @param[in] 	flag 	Flag used in  UART
                                                                         *transfer, should be NONE_BLOCKING or BLOCKING
                                                                         * @return 		Number of bytes sent.
                                                                         *
                                                                         * Note: when using UART in BLOCKING mode, a
                                                                         *time-out condition is used via defined symbol
                                                                         *UART_BLOCKING_TIMEOUT.
                                                                         **********************************************************************/
uint32_t UART_Send(LPC_UART_TypeDef* UARTx, uint8_t* txbuf, uint32_t buflen, TRANSFER_BLOCK_Type flag)
{
    uint32_t bToSend, bSent, timeOut, fifo_cnt;
    uint8_t* pChar = txbuf;

    bToSend = buflen;

    // blocking mode
    if (flag == BLOCKING)
    {
        bSent = 0;
        while (bToSend)
        {
            timeOut = UART_BLOCKING_TIMEOUT;
            // Wait for THR empty with timeout
            while (!(UARTx->LSR & UART_LSR_THRE))
            {
                if (timeOut == 0)
                    break;
                timeOut--;
            }
            // Time out!
            if (timeOut == 0)
                break;
            fifo_cnt = UART_TX_FIFO_SIZE;
            while (fifo_cnt && bToSend)
            {
                UART_SendByte(UARTx, (*pChar++));
                fifo_cnt--;
                bToSend--;
                bSent++;
            }
        }
    }
    // None blocking mode
    else
    {
        bSent = 0;
        while (bToSend)
        {
            if (!(UARTx->LSR & UART_LSR_THRE))
            {
                break;
            }
            fifo_cnt = UART_TX_FIFO_SIZE;
            while (fifo_cnt && bToSend)
            {
                UART_SendByte(UARTx, (*pChar++));
                bToSend--;
                fifo_cnt--;
                bSent++;
            }
        }
    }
    return bSent;
}

/*********************************************************************/ /**
  * @brief		Receive a block of data via UART peripheral
  * @param[in]	UARTx	Selected UART peripheral used to send data,
  * 				should be:
  *   			- LPC_UART0: UART0 peripheral
  * 				- LPC_UART1: UART1 peripheral
  * 				- LPC_UART2: UART2 peripheral
  * 				- LPC_UART3: UART3 peripheral
  * @param[out]	rxbuf 	Pointer to Received buffer
  * @param[in]	buflen 	Length of Received buffer
  * @param[in] 	flag 	Flag mode, should be NONE_BLOCKING or BLOCKING

  * @return 		Number of bytes received
  *
  * Note: when using UART in BLOCKING mode, a time-out condition is used
  * via defined symbol UART_BLOCKING_TIMEOUT.
  **********************************************************************/
uint32_t UART_Receive(LPC_UART_TypeDef* UARTx, uint8_t* rxbuf, uint32_t buflen, TRANSFER_BLOCK_Type flag)
{
    uint32_t bToRecv, bRecv, timeOut;
    uint8_t* pChar = rxbuf;

    bToRecv = buflen;

    // Blocking mode
    if (flag == BLOCKING)
    {
        bRecv = 0;
        while (bToRecv)
        {
            timeOut = UART_BLOCKING_TIMEOUT;
            while (!(UARTx->LSR & UART_LSR_RDR))
            {
                if (timeOut == 0)
                    break;
                timeOut--;
            }
            // Time out!
            if (timeOut == 0)
                break;
            // Get data from the buffer
            (*pChar++) = UART_ReceiveByte(UARTx);
            bToRecv--;
            bRecv++;
        }
    }
    // None blocking mode
    else
    {
        bRecv = 0;
        while (bToRecv)
        {
            if (!(UARTx->LSR & UART_LSR_RDR))
            {
                break;
            }
            else
            {
                (*pChar++) = UART_ReceiveByte(UARTx);
                bRecv++;
                bToRecv--;
            }
        }
    }
    return bRecv;
}

/*********************************************************************/ /**
  * @brief		Force BREAK character on UART line, output pin UARTx TXD is
                 forced to logic 0.
  * @param[in]	UARTx	UART peripheral selected, should be:
  *  			- LPC_UART0: UART0 peripheral
  * 				- LPC_UART1: UART1 peripheral
  * 				- LPC_UART2: UART2 peripheral
  * 				- LPC_UART3: UART3 peripheral
  * @return 		None
  **********************************************************************/
void UART_ForceBreak(LPC_UART_TypeDef* UARTx)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));

