sangjun19/Deobfuscator/data/github_api/github_switch_codes_c/ICOMP-UNC_Los-Intocables_lpc17xx_uart.c
    tmp = 0;
    if (NewState == ENABLE)
    {
        if (ABConfigStruct->ABMode == UART_AUTOBAUD_MODE1)
        {
            tmp |= UART_ACR_MODE;
        }
        if (ABConfigStruct->AutoRestart == ENABLE)
        {
            tmp |= UART_ACR_AUTO_RESTART;
        }
    }

    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        if (NewState == ENABLE)
        {
            // Clear DLL and DLM value
            ((LPC_UART1_TypeDef*)UARTx)->LCR |= UART_LCR_DLAB_EN;
            ((LPC_UART1_TypeDef*)UARTx)->DLL = 0;
            ((LPC_UART1_TypeDef*)UARTx)->DLM = 0;
            ((LPC_UART1_TypeDef*)UARTx)->LCR &= ~UART_LCR_DLAB_EN;
            // FDR value must be reset to default value
            ((LPC_UART1_TypeDef*)UARTx)->FDR = 0x10;
            ((LPC_UART1_TypeDef*)UARTx)->ACR = UART_ACR_START | tmp;
        }
        else
        {
            ((LPC_UART1_TypeDef*)UARTx)->ACR = 0;
        }
    }
    else
    {
        if (NewState == ENABLE)
        {
            // Clear DLL and DLM value
            UARTx->LCR |= UART_LCR_DLAB_EN;
            UARTx->DLL = 0;
            UARTx->DLM = 0;
            UARTx->LCR &= ~UART_LCR_DLAB_EN;
            // FDR value must be reset to default value
            UARTx->FDR = 0x10;
            UARTx->ACR = UART_ACR_START | tmp;
        }
        else
        {
            UARTx->ACR = 0;
        }
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Clear Autobaud Interrupt Pending
                                                                         * @param[in]	UARTx	UART peripheral
                                                                         *selected, should be
                                                                         *   			- LPC_UART0: UART0 peripheral
                                                                         * 				- LPC_UART1: UART1 peripheral
                                                                         * 				- LPC_UART2: UART2 peripheral
                                                                         * 				- LPC_UART3: UART3 peripheral
                                                                         * @param[in]	ABIntType	type of auto-baud
                                                                         *interrupt, should be:
                                                                         * 				- UART_AUTOBAUD_INTSTAT_ABEO:
                                                                         *End of Auto-baud interrupt
                                                                         * 				- UART_AUTOBAUD_INTSTAT_ABTO:
                                                                         *Auto-baud time out interrupt
                                                                         * @return 		none
                                                                         **********************************************************************/
void UART_ABClearIntPending(LPC_UART_TypeDef* UARTx, UART_ABEO_Type ABIntType)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));
    if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
    {
        UARTx->ACR |= ABIntType;
    }
    else
        UARTx->ACR |= ABIntType;
}

/*********************************************************************/ /**
  * @brief		Enable/Disable transmission on UART TxD pin
  * @param[in]	UARTx	UART peripheral selected, should be:
  *   			- LPC_UART0: UART0 peripheral
  * 				- LPC_UART1: UART1 peripheral
  * 				- LPC_UART2: UART2 peripheral
  * 				- LPC_UART3: UART3 peripheral
  * @param[in]	NewState New State of Tx transmission function, should be:
  * 				- ENABLE: Enable this function
                 - DISABLE: Disable this function
  * @return none
  **********************************************************************/
void UART_TxCmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState)
{
    CHECK_PARAM(PARAM_UARTx(UARTx));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));

    if (NewState == ENABLE)
    {
        if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
        {
            ((LPC_UART1_TypeDef*)UARTx)->TER |= UART_TER_TXEN;
        }
        else
        {
            UARTx->TER |= UART_TER_TXEN;
        }
    }
    else
    {
        if (((LPC_UART1_TypeDef*)UARTx) == LPC_UART1)
        {
            ((LPC_UART1_TypeDef*)UARTx)->TER &= (~UART_TER_TXEN) & UART_TER_BITMASK;
        }
        else
        {
            UARTx->TER &= (~UART_TER_TXEN) & UART_TER_BITMASK;
        }
    }
}

/* UART IrDA functions ---------------------------------------------------*/

#ifdef _UART3

/*********************************************************************/ /**
                                                                         * @brief		Enable or disable inverting
                                                                         *serial input function of IrDA on UART
                                                                         *peripheral.
                                                                         * @param[in]	UARTx UART peripheral selected,
                                                                         *should be LPC_UART3 (only)
                                                                         * @param[in]	NewState New state of inverting
                                                                         *serial input, should be:
                                                                         * 				- ENABLE: Enable this function.
                                                                         * 				- DISABLE: Disable this
                                                                         *function.
                                                                         * @return none
                                                                         **********************************************************************/
void UART_IrDAInvtInputCmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState)
{
    CHECK_PARAM(PARAM_UART_IrDA(UARTx));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));

    if (NewState == ENABLE)
    {
        UARTx->ICR |= UART_ICR_IRDAINV;
    }
    else if (NewState == DISABLE)
    {
        UARTx->ICR &= (~UART_ICR_IRDAINV) & UART_ICR_BITMASK;
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Enable or disable IrDA function
                                                                         *on UART peripheral.
                                                                         * @param[in]	UARTx UART peripheral selected,
                                                                         *should be LPC_UART3 (only)
                                                                         * @param[in]	NewState New state of IrDA
                                                                         *function, should be:
                                                                         * 				- ENABLE: Enable this function.
                                                                         * 				- DISABLE: Disable this
                                                                         *function.
                                                                         * @return none
                                                                         **********************************************************************/
void UART_IrDACmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState)
{
    CHECK_PARAM(PARAM_UART_IrDA(UARTx));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));

    if (NewState == ENABLE)
    {
        UARTx->ICR |= UART_ICR_IRDAEN;
    }
    else
    {
        UARTx->ICR &= (~UART_ICR_IRDAEN) & UART_ICR_BITMASK;
    }
}

/*********************************************************************/ /**
  * @brief		Configure Pulse divider for IrDA function on UART peripheral.
  * @param[in]	UARTx UART peripheral selected, should be LPC_UART3 (only)
  * @param[in]	PulseDiv Pulse Divider value from Peripheral clock,
  * 				should be one of the following:
                 - UART_IrDA_PULSEDIV2 	: Pulse width = 2 * Tpclk
                 - UART_IrDA_PULSEDIV4 	: Pulse width = 4 * Tpclk
                 - UART_IrDA_PULSEDIV8 	: Pulse width = 8 * Tpclk
                 - UART_IrDA_PULSEDIV16 	: Pulse width = 16 * Tpclk
                 - UART_IrDA_PULSEDIV32 	: Pulse width = 32 * Tpclk
                 - UART_IrDA_PULSEDIV64 	: Pulse width = 64 * Tpclk
                 - UART_IrDA_PULSEDIV128 : Pulse width = 128 * Tpclk
                 - UART_IrDA_PULSEDIV256 : Pulse width = 256 * Tpclk

  * @return none
  **********************************************************************/
void UART_IrDAPulseDivConfig(LPC_UART_TypeDef* UARTx, UART_IrDA_PULSE_Type PulseDiv)
{
    uint32_t tmp, tmp1;
    CHECK_PARAM(PARAM_UART_IrDA(UARTx));
    CHECK_PARAM(PARAM_UART_IrDA_PULSEDIV(PulseDiv));

    tmp1 = UART_ICR_PULSEDIV(PulseDiv);
    tmp = UARTx->ICR & (~UART_ICR_PULSEDIV(7));
    tmp |= tmp1 | UART_ICR_FIXPULSE_EN;
    UARTx->ICR = tmp & UART_ICR_BITMASK;
}

#endif

/* UART1 FullModem function ---------------------------------------------*/

#ifdef _UART1

/*********************************************************************/ /**
  * @brief		Force pin DTR/RTS corresponding to given state (Full modem mode)
  * @param[in]	UARTx	LPC_UART1 (only)
  * @param[in]	Pin	Pin that NewState will be applied to, should be:
  * 				- UART1_MODEM_PIN_DTR: DTR pin.
  * 				- UART1_MODEM_PIN_RTS: RTS pin.
  * @param[in]	NewState New State of DTR/RTS pin, should be:
  * 				- INACTIVE: Force the pin to inactive signal.
                 - ACTIVE: Force the pin to active signal.
  * @return none
  **********************************************************************/
void UART_FullModemForcePinState(LPC_UART1_TypeDef* UARTx, UART_MODEM_PIN_Type Pin, UART1_SignalState NewState)
{
    uint8_t tmp = 0;

    CHECK_PARAM(PARAM_UART1_MODEM(UARTx));
    CHECK_PARAM(PARAM_UART1_MODEM_PIN(Pin));
    CHECK_PARAM(PARAM_UART1_SIGNALSTATE(NewState));

    switch (Pin)
    {
        case UART1_MODEM_PIN_DTR: tmp = UART1_MCR_DTR_CTRL; break;
        case UART1_MODEM_PIN_RTS: tmp = UART1_MCR_RTS_CTRL; break;
        default: break;
    }

    if (NewState == ACTIVE)
    {
        UARTx->MCR |= tmp;
    }
    else
    {
        UARTx->MCR &= (~tmp) & UART1_MCR_BITMASK;
    }
}

/*********************************************************************/ /**
  * @brief		Configure Full Modem mode for UART peripheral
  * @param[in]	UARTx	LPC_UART1 (only)
  * @param[in]	Mode Full Modem mode, should be:
  * 				- UART1_MODEM_MODE_LOOPBACK: Loop back mode.
  * 				- UART1_MODEM_MODE_AUTO_RTS: Auto-RTS mode.
  * 				- UART1_MODEM_MODE_AUTO_CTS: Auto-CTS mode.
  * @param[in]	NewState New State of this mode, should be:
  * 				- ENABLE: Enable this mode.
                 - DISABLE: Disable this mode.
  * @return none
  **********************************************************************/
void UART_FullModemConfigMode(LPC_UART1_TypeDef* UARTx, UART_MODEM_MODE_Type Mode, FunctionalState NewState)
{
    uint8_t tmp = 0;

    CHECK_PARAM(PARAM_UART1_MODEM(UARTx));
    CHECK_PARAM(PARAM_UART1_MODEM_MODE(Mode));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(NewState));

    switch (Mode)
    {
        case UART1_MODEM_MODE_LOOPBACK: tmp = UART1_MCR_LOOPB_EN; break;
        case UART1_MODEM_MODE_AUTO_RTS: tmp = UART1_MCR_AUTO_RTS_EN; break;
        case UART1_MODEM_MODE_AUTO_CTS: tmp = UART1_MCR_AUTO_CTS_EN; break;
        default: break;
    }

    if (NewState == ENABLE)
    {
        UARTx->MCR |= tmp;
    }
    else
    {
        UARTx->MCR &= (~tmp) & UART1_MCR_BITMASK;
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Get current status of modem
                                                                         *status register
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @return 		Current value of modem status
                                                                         *register Note:	The return value of this
                                                                         *function must be ANDed with each member
                                                                         * 			UART_MODEM_STAT_type enumeration to
                                                                         *determine current flag status corresponding to
                                                                         *each modem flag status. Because some flags in
                                                                         * 			modem status register will be
                                                                         *cleared after reading, the next reading modem
                                                                         *register could not be correct. So this
                                                                         *function used to read modem status register in
                                                                         *one time only, then the return value used to
                                                                         *check all flags.
                                                                         **********************************************************************/
uint8_t UART_FullModemGetStatus(LPC_UART1_TypeDef* UARTx)
{
    CHECK_PARAM(PARAM_UART1_MODEM(UARTx));
    return ((UARTx->MSR) & UART1_MSR_BITMASK);
}

/* UART RS485 functions --------------------------------------------------------------*/

/*********************************************************************/ /**
                                                                         * @brief		Configure UART peripheral in
                                                                         *RS485 mode according to the specified
                                                                         *parameters in the RS485ConfigStruct.
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @param[in]	RS485ConfigStruct Pointer to a
                                                                         *UART1_RS485_CTRLCFG_Type structure that
                                                                         *contains the configuration information for
                                                                         *specified UART in RS485 mode.
                                                                         * @return		None
                                                                         **********************************************************************/
void UART_RS485Config(LPC_UART1_TypeDef* UARTx, UART1_RS485_CTRLCFG_Type* RS485ConfigStruct)
{
    uint32_t tmp;

    CHECK_PARAM(PARAM_UART1_MODEM(UARTx));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->AutoAddrDetect_State));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->AutoDirCtrl_State));
    CHECK_PARAM(PARAM_UART1_RS485_CFG_DELAYVALUE(RS485ConfigStruct->DelayValue));
    CHECK_PARAM(PARAM_SETSTATE(RS485ConfigStruct->DirCtrlPol_Level));
    CHECK_PARAM(PARAM_UART_RS485_DIRCTRL_PIN(RS485ConfigStruct->DirCtrlPin));
    CHECK_PARAM(PARAM_UART1_RS485_CFG_MATCHADDRVALUE(RS485ConfigStruct->MatchAddrValue));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->NormalMultiDropMode_State));
    CHECK_PARAM(PARAM_FUNCTIONALSTATE(RS485ConfigStruct->Rx_State));

