sangjun19/Deobfuscator/data/github_api/github_switch_codes_c/ICOMP-UNC_Los-Intocables_lpc17xx_uart.c
    tmp = 0;
    // If Auto Direction Control is enabled -  This function is used in Master mode
    if (RS485ConfigStruct->AutoDirCtrl_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_DCTRL_EN;

        // Set polar
        if (RS485ConfigStruct->DirCtrlPol_Level == SET)
        {
            tmp |= UART1_RS485CTRL_OINV_1;
        }

        // Set pin according to
        if (RS485ConfigStruct->DirCtrlPin == UART1_RS485_DIRCTRL_DTR)
        {
            tmp |= UART1_RS485CTRL_SEL_DTR;
        }

        // Fill delay time
        UARTx->RS485DLY = RS485ConfigStruct->DelayValue & UART1_RS485DLY_BITMASK;
    }

    // MultiDrop mode is enable
    if (RS485ConfigStruct->NormalMultiDropMode_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_NMM_EN;
    }

    // Auto Address Detect function
    if (RS485ConfigStruct->AutoAddrDetect_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_AADEN;
        // Fill Match Address
        UARTx->ADRMATCH = RS485ConfigStruct->MatchAddrValue & UART1_RS485ADRMATCH_BITMASK;
    }

    // Receiver is disable
    if (RS485ConfigStruct->Rx_State == DISABLE)
    {
        tmp |= UART1_RS485CTRL_RX_DIS;
    }

    // write back to RS485 control register
    UARTx->RS485CTRL = tmp & UART1_RS485CTRL_BITMASK;

    // Enable Parity function and leave parity in stick '0' parity as default
    UARTx->LCR |= (UART_LCR_PARITY_F_0 | UART_LCR_PARITY_EN);
}

/*********************************************************************/ /**
                                                                         * @brief		Enable/Disable receiver in RS485
                                                                         *module in UART1
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @param[in]	NewState	New State of
                                                                         *command, should be:
                                                                         * 							- ENABLE: Enable
                                                                         *this function.
                                                                         * 							- DISABLE: Disable
                                                                         *this function.
                                                                         * @return		None
                                                                         **********************************************************************/
void UART_RS485ReceiverCmd(LPC_UART1_TypeDef* UARTx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        UARTx->RS485CTRL &= ~UART1_RS485CTRL_RX_DIS;
    }
    else
    {
        UARTx->RS485CTRL |= UART1_RS485CTRL_RX_DIS;
    }
}

/*********************************************************************/ /**
                                                                         * @brief		Send data on RS485 bus with
                                                                         *specified parity stick value (9-bit mode).
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @param[in]	pDatFrm 	Pointer to data
                                                                         *frame.
                                                                         * @param[in]	size		Size of data.
                                                                         * @param[in]	ParityStick	Parity Stick value,
                                                                         *should be 0 or 1.
                                                                         * @return		None
                                                                         **********************************************************************/
uint32_t UART_RS485Send(LPC_UART1_TypeDef* UARTx, uint8_t* pDatFrm, uint32_t size, uint8_t ParityStick)
{
    uint8_t tmp, save;
    uint32_t cnt;

    if (ParityStick)
    {
        save = tmp = UARTx->LCR & UART_LCR_BITMASK;
        tmp &= ~(UART_LCR_PARITY_EVEN);
        UARTx->LCR = tmp;
        cnt = UART_Send((LPC_UART_TypeDef*)UARTx, pDatFrm, size, BLOCKING);
        while (!(UARTx->LSR & UART_LSR_TEMT))
        {
        }
        UARTx->LCR = save;
    }
    else
    {
        cnt = UART_Send((LPC_UART_TypeDef*)UARTx, pDatFrm, size, BLOCKING);
        while (!(UARTx->LSR & UART_LSR_TEMT))
        {
        }
    }
    return cnt;
}

/*********************************************************************/ /**
                                                                         * @brief		Send Slave address frames on
                                                                         *RS485 bus.
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @param[in]	SlvAddr Slave Address.
                                                                         * @return		None
                                                                         **********************************************************************/
void UART_RS485SendSlvAddr(LPC_UART1_TypeDef* UARTx, uint8_t SlvAddr)
{
    UART_RS485Send(UARTx, &SlvAddr, 1, 1);
}

/*********************************************************************/ /**
                                                                         * @brief		Send Data frames on RS485 bus.
                                                                         * @param[in]	UARTx	LPC_UART1 (only)
                                                                         * @param[in]	pData Pointer to data to be
                                                                         *sent.
                                                                         * @param[in]	size Size of data frame to be
                                                                         *sent.
                                                                         * @return		None
                                                                         **********************************************************************/
uint32_t UART_RS485SendData(LPC_UART1_TypeDef* UARTx, uint8_t* pData, uint32_t size)
{
    return (UART_RS485Send(UARTx, pData, size, 0));
}

#endif /* _UART1 */

#endif /* _UART */

/**
 * @}
 */

/**
 * @}
 */
/* --------------------------------- End Of File ------------------------------ */
